{
    "date": "2024-03-12 19:10:31",
    "jobs": [
        {
            "posted_at": null,
            "applications": null,
            "title": "Software Engineer (NY Remote)",
            "company_name": "Prelim",
            "company_rating": null,
            "company_reviews": null,
            "location": "New York, NY",
            "location_type": "Remote",
            "apply_link": "https://www.indeed.com/applystart?jk=6d916e451a621efc&from=vj&pos=bottom&mvj=0&jobsearchTk=1hoqer59lj318814&spon=0&xkcb=SoCq67M3DaVjd_wdwB0KbzkdCdPP&xfps=78fe55dd-2d23-460d-af35-012a99dbe6b2&sjdu=YmZE5d5THV8u75cuc0H6Y26AwfY51UOGmh3Z9h4OvXgfa7OXfSJmL-uzKLCFfdCMDT35kX4XxNaC6rahdgaYYgbKmPU_BOn7fUHbn6Lw4vB8OHz5oHIRlHWW0BbQ3Z1QakR0bC1teKG5u8PXLYOQTNtrnRdiWIaFtmwsA6KkHbyKoiC2-qjaCvsolc3QlGUhCITeI_Azw3KcSOf4X9Vh1Q&vjfrom=vjs&astse=4dcec9695202d298&assa=1015",
            "pay": null,
            "job_type": null,
            "benefits": null,
            "description": "Develop the product that powers better access to banking\n\nPrelim is seeking a skilled and motivated software engineer to join our (small, but growing!) team. As a member of our team, you will have the opportunity to work on cutting-edge technology and be at the forefront of fintech, helping to increase access to banking for millions of people.\n\nAs a Software Engineer at Prelim, you will be responsible for developing the technology that powers our digital account opening solutions. You will work closely with our product and development teams to bring new features and improvements to our platform, ensuring that we are providing the best possible experience for our users.\nKey Responsibilities:\nWork closely with our product and development teams to bring new features and improvements to our platform\nTroubleshoot and debug customer issues, and build features to address them\nHelp assess and recruit future engineers\nQualifications:\nHave strong software engineering skills and are proficient in JS and SQL\nStrong problem-solving and analytical skills\nExcellent communication and teamwork abilities\n$115,000 - $120,000 a year\nAbout Prelim:\n\nPrelim is a US only remote startup that helps banks onboard their customers. Prelim is designed to streamline the account opening process for both consumers and businesses, increasing speed-to-market and improving the customer experience for financial institutions.\n\nIf you're excited to be part of a team that is shaping the future of the banking industry, then we encourage you to apply to join us at Prelim. We are looking for individuals who are driven, ambitious, and excited about the opportunity to make a real impact on an old industry in need of technological innovation.\n\n\n#LI-Remote"
        },
        {
            "posted_at": null,
            "applications": null,
            "title": "Software Engineer",
            "company_name": "New York eHealth Collaborative",
            "company_rating": null,
            "company_reviews": null,
            "location": "New York, NY 10006",
            "location_type": "Remote",
            "apply_link": null,
            "pay": null,
            "job_type": null,
            "benefits": [
                "401(k)",
                "401(k) 7% Match",
                "401(k) matching",
                "AD&D insurance",
                "Bereavement leave",
                "Caregiver leave",
                "Dental insurance"
            ],
            "description": "APPLY HERE: https://www.paycomonline.net/v4/ats/web.php/jobs/ViewJobDetails?job=150093&clientkey=857FAA4536B1C20147B058DC992520A1\nPosition Summary\nNYeC is seeking a Software Engineer who has an in-depth understanding of web application development, object-oriented programming, web services, systems design and cloud computing. An appreciation for clinical information technology; its capabilities, limitations, and impact on clinical practice would be preferred but not mandatory. In addition, knowledge of the FHIR framework and associated protocols is desirable.\nThis position reports to the Innovation Center Lead and is based out of the Albany or Manhattan office location.\nResponsibilities include but are not limited to:\nDevelop enterprise scale web applications utilizing RESTful APIs aimed at solving healthcare data interoperability challenges. This work often starts with prototypes, and proof of concepts, then builds upon an MVP.\nExperience working with healthcare data ecosystems, including Electronic Health Records (EHRs), for seamless integration and data exchange.\nDefines technical solution requirements for the implementation of cross-platform, integrated services, with a specific focus on FHIR standards, in a complex statewide healthcare environment.\nDevelops technical diagrams, systems maps, code, and documentation for code to be deployed in Amazon, with a strong deference for serverless solutions.\nCollaborates with healthcare professionals, customers, and knowledge publishers to ensure solutions meet clinical and operational needs.\nContributes expertise into the multi-generation product and services roadmap.\nEnsures all developments are compliant with healthcare industry standards and regulations, including HIPAA, to maintain data security and patient privacy.\nDesign, architect, build, and maintain cloud-based systems in a healthcare setting, including cloud-native serverless applications, ensuring high availability and compliance with healthcare data standards.\nOther duties as assigned.\nExperience and Skills:\nBS in Computer Engineering or Computer Science required, Master’s degree preferred. 3 - 5 years of experience in a software engineering environment, with a focus on developing solutions in Amazon Web Services (AWS).\nStrong ability to understand and design objects and interfaces, with an emphasis on cloud-based architectures.\nCapability to interact with multiple vendors and develop comprehensive solutions within the AWS ecosystem.\nSolid experience with Service Oriented Architecture, particularly in AWS.\n3-5 years of experience in developing enterprise-class software using languages such as Node.js, Python, and React, specifically for AWS environments.\nProficiency in AWS cloud services, server management, and understanding of back-end infrastructure.\nExperience in working with AWS container management services, including Docker and Kubernetes.\nFull-stack development skills, including strong User Interface design and implementation, optimized for cloud-based solutions.\nDeep understanding of data modeling and database systems, with experience in SQL (MsSQL, Postgres) and noSQL databases (AWS DynamoDB), and their integration in AWS.\nKnowledge of healthcare interoperability standards such as FHIR, HL7, CDA is preferred, with a focus on applications in cloud environments.\nAWS certifications or certifications from other major Cloud providers (Azure, Google) are highly preferred.\nExpectations of Employees:\nNYeC supports the healthcare sector, and we expect every employee to be vaccinated in accordance with NYeC’s policy before beginning employment with NYeC and present proof prior to their start date, unless they have requested and been granted an exemption or accommodation (based on disability/medical condition or a sincerely held religious belief).\nBarring specific exemptions, team members are expected to work from the office on a regular schedule determined by the COO and on other days specified by their manager (no less than 1 day per week in the office). This schedule is subject to change.\nNYeC supports work happening across New York State. From time to time our team members must visit other parts of the state. The most common requirement is for a New York City based team member to travel to Albany and vice versa.\nWe consider a wide range of factors when determining compensation, which may cause compensation to vary depending on your skills, experience, qualifications, and home office location (Manhattan, NY vs. Albany, NY). The annual base salary range for this role for an Albany, NY based candidate is $70,000 - $83,000. The annual base salary range for this role for a Manhattan, NY based candidate is $85,000 - $100,000. The salary offer will not be based on a candidate’s salary history at other jobs, and by law, NYeC will not seek information about salary history, and candidates should not share such information with NYeC. All compensation questions and comments should be directed to the HR Department representative during your application, interview, and hiring process.\nNYeC is an Equal Opportunity Employer. We are dedicated to building a diverse, inclusive, and authentic workplace, so if you are excited about this role but your past experience doesn't align perfectly with everything listed in the job description, we encourage you to apply anyways. You may be just the right candidate for this or other roles.\nFor more information about NYeC and to apply for this position, visit our website at https://www.nyehealth.org/careers/. We accept online applications only.\nJob Type: Full-time\nPay: $70,000.00 - $100,000.00 per year\nBenefits:\n401(k)\n401(k) 7% Match\n401(k) matching\nAD&D insurance\nBereavement leave\nCaregiver leave\nDental insurance\nDependent care reimbursement\nDependent health insurance coverage\nDisability insurance\nEmployee assistance program\nEmployee mentoring program\nFamily leave\nFlexible spending account\nFood provided\nFree fitness classes\nGym membership\nHappy hour\nHealth insurance\nLife insurance\nLunch & learns\nMilitary leave\nOn-the-job training\nPaid holidays\nPaid jury duty\nPaid military leave\nPaid parental leave\nPaid sick time\nPaid time off\nParental leave\nPartner benefits\nPrescription drug insurance\nProfessional development assistance\nReferral program\nRetirement plan\nSnacks provided\nTuition reimbursement\nVision insurance\nWellness program\nWork from home\nCompensation package:\nBonus opportunities\nPerformance bonus\nQuarterly bonus\nExperience level:\n3 years\n4 years\n5 years\nSchedule:\nDay shift\nAbility to Relocate:\nNew York, NY 10006: Relocate before starting work (Required)\nWork Location: Hybrid remote in New York, NY 10006"
        },
        {
            "posted_at": null,
            "applications": null,
            "title": "Front End Engineer- USA",
            "company_name": "Mark43",
            "company_rating": null,
            "company_reviews": null,
            "location": "New York, NY",
            "location_type": "Remote",
            "apply_link": null,
            "pay": null,
            "job_type": null,
            "benefits": [
                "401(k)",
                "Health insurance",
                "Paid time off",
                "Stock options"
            ],
            "description": "Mark43 is approved to hire in 40 states, including AL, AZ, CA-excluding San Francisco, CO, CT, DC, DE, FL, GA, IA, ID, IL, IN, KS, LA, MA, MD, ME, MI, MN, MO, NE, NV, NH, NJ, NM, NY, NC, OH, OR, PA, SC, SD, TN, TX, UT, VA, VT, WA, and WI. Before applying to a remote role, please ensure that you are able to perform the position in one of the states listed above. State locations and specifics are subject to change as our hiring requirements shift.\nMark43's mission is to empower communities and their governments with new technologies that improve the safety and quality of life for all. We build powerful, scalable, and elegant software that sets a new standard for the tools upon which our first responders rely. Our users are diverse, and we are therefore committed to embracing diversity of thought and experience within our team.\nWe're seeking a front end web engineer to help build the Mark43 law enforcement suite. We leverage new technologies to tackle unique enterprise challenges not found in the consumer web space in an effort to replace our competitors' legacy systems.\n\nWhat you can expect to work on:\nUsing popular technologies including but not limited to: React, Redux, Electron, TypeScript, RxJS\nContinuously improving your coding skills while working alongside a talented and high performing engineering team\nCollaborating with design and product teams to understand feature requirements\nContributing to discussions on use cases for new technologies and a constant dialogue on ways to improve our codebase and engineering practices. Currently we're investigating use cases for React Native and GraphQL.\nNurturing an engineering culture that cares deeply about the quality of the code we write, while still working quickly to bring our technology to as many departments as possible\n\nWhat we expect from you:\n2+ years of industry experience, preferably building rich web applications using high performance javascript\nExtensive knowledge of javascript and its many frameworks, HTML, CSS, and an interest in testing out new FE technologies\nKnowledge of web architecture concepts including HTTP and REST\nExperience supporting continuous integration and automated testing\nWillingness to contribute to technical discussions and defend your opinions\n\nWhat you can expect from us:\nGuidance from more senior engineers and the opportunity to refine your technical skills\nConstant collaboration with numerous Mark43 teams, including Engineering, Technical Services, and Product\nBuilding mission critical and socially responsible software to enable first responders to better serve their communities\nA team that respects and embraces your ideas\nCoworkers that are motivated by pursuing excellence, rather than the prospect of personal gain\nA workplace dedicated to supporting and bettering public safety and government agencies\n\nWe feel passionately about equal pay for equal work, and transparency in compensation is one vehicle to achieve that. Total compensation for this role is market competitive, including a target base annual salary range of $110,000-$145,000, plus bonus opportunity, company stock options, and a full benefits package, including health insurance, paid time off, and a 401k. Please note that the higher end of this range will be reserved for candidates with appropriate experience who reside in high cost of living areas.\nMark43 is committed to the full inclusion of all qualified individuals. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex disability, age, sexual orientation, gender identity, national origin, veteran status, or genetic information. As part of this commitment, we will ensure that persons with disabilities are provided reasonable accommodations. If reasonable accommodation is needed, please email recruiting@Mark43.com requesting the accommodation."
        },
        {
            "posted_at": null,
            "applications": null,
            "title": "Software Engineer, Data (Remote)",
            "company_name": "Jun Group",
            "company_rating": null,
            "company_reviews": null,
            "location": "New York, NY",
            "location_type": "Remote",
            "apply_link": null,
            "pay": null,
            "job_type": null,
            "benefits": [
                "401(k) matching",
                "Paid time off",
                "Work from home"
            ],
            "description": "Do you hate advertising? We do too. Our view is that the advertising business is broken and needs to change, and we are a big part of the answer. Jun Group means truth, and our culture is about openness, honesty and innovation. We work with the largest brands in the world to run advertisements that are 100% opt-in, putting consumers in control and turning the industry on its head.\nWe are looking for a Data Engineer to join our machine learning and data science team. This position is full-time and 100% remote with the option of working on-site once it is safe to do so. Jun Group will only consider candidates for this position who are currently legally authorized to work in the United States.\nWho you are\nYou enjoy a fun, creative, and engaging working atmosphere free of brilliant jerks\nYou want to be part of a small team inside a large company with massive opportunity for growth\nYou enjoy collaboration with other teams including product, biz dev, and our in-house QA team\nYou eagerly dig into complex engineering problems\nWhat you'll do\nContribute to exciting greenfield projects\nOwn all things data - including our ETL processes, reporting APIs, and internal dashboards\nCollaborate with our engineering team to improve our existing machine learning models and tooling\nExperiment with new tech to find the right tool for the job\nUse Kanban to manage multiple releases per week\nMaintain high code quality through code reviews and automated tests\nQualifications\nExperience working with streaming and batch data processing tools like Apache Beam, Spark, Flink, etc.\nYou've built and maintained an ETL pipeline using a data warehouse like BigQuery or Redshift\nYou're comfortable writing SQL and manipulating large structured or unstructured datasets for analysis\nPractical knowledge of how to build efficient end-to-end ML workflows\nFamiliarity with AWS or Google Cloud big data products\nWhat we offer\nA highly competitive compensation package\n401k with company match\nPaid vacation, work from home, and sick days\nDesignated time to work on company-related projects you feel strongly about\nMacbook Pros and any other equipment you need to work effectively from home\nGreater NY-area Residents: We currently have a hybrid remote work policy. All Jun Group employees living within a 90-minute (one way) commute of our NYC office are expected to be in the office two days per week.\nSalary Range: $80,000 - $110,000 + incentive pay\nLearn what our engineering team likes about Jun Group here.\nJun Group is a high-powered, collaborative environment. We are looking for candidates who work well in teams, enjoy learning, and challenge the status quo. We work hard, and we have lives, too. We pay competitively based on experience, and we're open to allowing the right person to learn our industry on the job.\nWe have excellent perks and benefits, and we welcome diversity and non-traditional paths into all of our roles. We believe in hiring the right person as opposed to the right combination of keywords."
        },
        {
            "posted_at": null,
            "applications": null,
            "title": "Software Engineer - SDK",
            "company_name": "Hatch IT",
            "company_rating": null,
            "company_reviews": null,
            "location": "New York, NY",
            "location_type": "Remote",
            "apply_link": "https://www.indeed.com/applystart?jk=d2327502aba05afc&from=vj&pos=bottom&mvj=0&jobsearchTk=1hoqer59lj318814&spon=0&xkcb=SoC567M3DaVjd_wdwB0ObzkdCdPP&xfps=561a0d26-8fbd-4aa2-bab0-d8515ba9af4f&sjdu=YmZE5d5THV8u75cuc0H6Y26AwfY51UOGmh3Z9h4OvXjVJFfIiLzOLfdoSKCFuZcqkI0De3e0nEh30vrZQLh75KVfs5B-9_JF2yKF621-HduhRihfJ9_E6ndFVxbsGW6vFSUYmzNMULBHGHQpY8p_zOoOWEFxFJXGtsYTK2aIWDv1IEaBYDq-_rD5HSJEWmUqCITeI_Azw3KcSOf4X9Vh1Q&vjfrom=vjs&astse=ca9bc89e190a9f2d&assa=5351",
            "pay": null,
            "job_type": null,
            "benefits": null,
            "description": "Hatch I.T. is partnering with a Pryon, to find a Software Engineer - SDK. See details below:\n\nAbout the role:\nPryon is actively seeking a Software Engineer to become a valuable addition to their team. In this capacity, you will play a pivotal role in the design, development, and integration of intricate software components and microservices into cloud-based architectures. They are in search of a proactive and accomplished individual who can take full responsibility for their contributions, foster productive collaboration with our Research and Product teams and possess a deep-seated enthusiasm for ongoing learning and innovation to advance their objectives.\n\nAbout the company:\nPryon is a team of AI, tech, and language experts whose DNA lives in Alexa, Siri, Watson, and virtually every human language technology product on the market. Now they're building an industry-leading knowledge management platform. Their proprietary, cutting-edge natural language processing capabilities transform unstructured data into meaningful experiences that increase productivity with unmatched accuracy and speed.\nIn This Role, You Will:\nCollaborate closely with peers to design and code robust, scalable, and loosely coupled components and microservices that seamlessly integrate with both public and private cloud infrastructure, as well as on-premises applications\nApply architectural and design principles consistently to facilitate end-to-end usage scenarios\nEmphasize DevOps use-cases and workflows to enhance efficiency\nOptimize internally for extensibility and enabling development teams to operate quickly\nWork with SCRUM teams and Product Management to refine requirements, understand how we will meet the broader properties of the system, and help design efficient, flexible, highly scalable, and extensible services\nDrive critical component design decisions across working teams\nWork to drive decisions through a crisp decision-making process and framework\nAnalyze criteria and options and bring together necessary data to answer key questions\nMeet with key partners, internal teams and 3rd party partners in joint design and development efforts while being able to articulate roadmap and product architecture\nWhat You'll Need to Be Successful:\nA minimum of 3 years of relevant work experience\nExperience building libraries and/or SDKs is a plus\nCoding experience in languages such as Golang, and Python\nExperience crafting complex product technologies and initiatives from concept through release\nDemonstrated excellence in written and verbal communications\nRegularly demonstrates collaboration by promoting others’ ideas, influencing others, and making teams successful\nParticipates on cross functional design teams to develop expertise in other modules/systems\nEngages with Product Management to drive detailed product requirements\nExcellent organizational agility and interpersonal skills throughout the organization\nDon't think you're 100% qualified for this position? Studies have shown that women and people of color are less likely to apply to jobs unless they meet every single qualification. At hatch I.T., we're dedicated to helping companies build diverse, inclusive and authentic workplaces, so if your experience doesn't perfectly align with every qualification in the job description, we encourage you to apply anyway. You may just be the right candidate for this or other roles.\n\nIf you are interested in learning more about this company or any Startups/Small Businesses in the area, please contact us and check us out here!!\nWe are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status."
        },
        {
            "posted_at": null,
            "applications": null,
            "title": "Software Engineer - SDK",
            "company_name": "Pryon",
            "company_rating": null,
            "company_reviews": null,
            "location": "New York, NY",
            "location_type": "Remote",
            "apply_link": null,
            "pay": null,
            "job_type": null,
            "benefits": [
                "401(k)",
                "Dental insurance",
                "Disability insurance",
                "Health insurance",
                "Life insurance",
                "Unlimited paid time off",
                "Vision insurance"
            ],
            "description": "About Pryon:\nWe’re a team of AI, tech, and language experts whose DNA lives in Alexa, Siri, Watson, and virtually every human language technology product on the market. Now we’re building an industry-leading knowledge management platform. Our proprietary, cutting-edge natural language processing capabilities transform unstructured data into meaningful experiences that increase productivity with unmatched accuracy and speed.\n\nWe are actively seeking a Software Engineer to become a valuable addition to our team. In this capacity, you will assume a pivotal role in the design, development, and integration of intricate software components and microservices into cloud-based architectures. We are in search of a proactive and accomplished individual who can take full responsibility for their contributions, foster productive collaboration with our Research and Product teams, and possess a deep-seated enthusiasm for ongoing learning and innovation to advance our objectives.\nIn This Role, You Will:\nCollaborate closely with peers to design and code robust, scalable, and loosely coupled components and microservices that seamlessly integrate with both public and private cloud infrastructure, as well as on-premises applications\nApply architectural and design principles consistently to facilitate end-to-end usage scenarios\nEmphasize DevOps use-cases and workflows to enhance efficiency\nOptimize internally for extensibility and enabling development teams to operate quickly\nWork with SCRUM teams and Product Management to refine requirements, understand how we will meet the broader properties of the system, and help design efficient, flexible, highly scalable, and extensible services\nDrive critical component design decisions across working teams\nWork to drive decisions through a crisp decision-making process and framework\nAnalyze criteria and options and bring together necessary data to answer key questions\nMeet with key partners, internal teams and 3rd party partners in joint design and development efforts while being able to articulate roadmap and product architecture\nWhat You'll Need to Be Successful:\nA minimum of 3 years of relevant work experience\nExperience building libraries and/or SDKs is a plus\nCoding experience in languages such as Golang, and Python\nExperience crafting complex product technologies and initiatives from concept through release\nDemonstrated excellence in written and verbal communications\nRegularly demonstrates collaboration by promoting others’ ideas, influencing others, and making teams successful\nParticipates on cross functional design teams to develop expertise in other modules/systems\nEngages with Product Management to drive detailed product requirements\nExcellent organizational agility and interpersonal skills throughout the organization\nAnnual salary is only one component of overall compensation. Actual salaries are based on factors such as work experience and education and may vary from the specified range.\n\nBenefits for Full Time Employees:\n100% Company paid Health/Dental/Vision benefits for you and your dependents\nLife Insurance, Short-term and Long-term Disability\n401k\nUnlimited PTO\n\nWe are interested in every qualified candidate who is authorized to work in the United States. However, we are not able to sponsor or take over sponsorship of employment Visas at this time.\n\nPryon is an equal-opportunity employer and values diversity. We do not discriminate based on race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability."
        },
        {
            "posted_at": null,
            "applications": null,
            "title": "Full-Stack Software Engineer",
            "company_name": "Olo",
            "company_rating": null,
            "company_reviews": null,
            "location": "New York, NY",
            "location_type": "Remote",
            "apply_link": null,
            "pay": null,
            "job_type": null,
            "benefits": [
                "401(k) matching",
                "Dental insurance",
                "Health insurance",
                "Paid time off",
                "Parental leave",
                "Vision insurance",
                "Volunteer time off"
            ],
            "description": "At Olo we develop an online food ordering platform used by many of the country's largest restaurant chains, reaching millions of consumers. Chances are, if you've ordered directly from a restaurant brand's app or website, we've made that happen.\n\nAs a Full-Stack Software Engineer on our team, you will develop, scale, and monitor solutions, improvements, and services across our Olo Engage product suite. Our software products support our brands in harnessing guest data from across their tech stack to boost retention, lower acquisition costs, and do more with less. Find out more at https://www.olo.com/engage\n\nWe aim to collaborate well. We encourage new ideas and experimentation. No part of the codebase is off-limits. You'll work with a passionate team dedicated to delivering amazing products using modern technologies.\n\nYou can work remotely from anywhere in the U.S. or at Olo’s headquarters in Tribeca, NYC.\n\nWhat You'll Do\nDesign and build reliable but simple solutions to complex problems at scale.\nObserve system performance in your domain and identify emerging problems.\nAssess and resolve production incidents that arise in the components your team manages.\nResearch and propose new technologies to apply.\nLook for diverse perspectives and challenging business and technical assumptions.\nProvide constructive criticism to build the team's overall strength.\nSatisfy commitments in a timely manner.\nWhat We'll Expect From You\n3+ years on-the-job development experience\nSolid experience with frontend and backend frameworks such as Vue.js, Node.js or similar\nExperience writing unit tests and testable code\nBias for working in a highly collaborative team environment\n\nOur Tech Stack\nLanguages: Javascript, Typescript\nFrameworks: Vue, Node\nDatastores: PostgreSQL, ElasticSearch\nDeployment: Kubernetes, Helm\nInfrastructure: AWS\nTooling: GitLab, Datadog, SumoLogic\nAbout Olo\n\nOlo is the engine of hospitality powering the restaurant industry's digital transformation. As a leading open SaaS platform, we enable over 600 restaurant brands to jointly reach 85 million connected guests across approximately 78,000 locations. More than two million orders per day run on Olo's platform, allowing brands to maximize the convergence of digital and brick-and-mortar operations while raising the bar on hospitality. The result: brands do more with less and make every guest feel like a regular. With integrations to over 300 technology partners, our customers can build digital experiences with the largest and most flexible restaurant commerce ecosystem on the market. You have likely used Olo and not even known it! Learn more at olo.com.\n\nWe’re remote-friendly. Since 2015, we have been evolving our culture to continue to support a more distributed workforce and now over 75% of our team works remotely across the U.S. If you're in the New York City area, you can choose to work remotely or from Olo's headquarters, located in Tribeca.\n\nWe offer great benefits, such as 20 days of paid time off, 10 separate sick days, 11 holidays plus year-end closure, health, dental, and vision coverage for yourself and your family, a 401k match, remote-office stipend, company equity, a generous parental leave plan, volunteer time off, gift matching policy, and more!\n\nOur best estimate of the compensation range for this opportunity is $105k-150k annually as a Mid-level and $125k-175k annually as a Senior I, depending on the experience you bring and your location. We look forward to discussing your salary expectations and our full total rewards offerings throughout the interview process.\n\nWe encourage you to apply!\n\nWe value diversity. At Olo, we know a diverse and inclusive team makes our workplace better. Don't meet every single qualification in the job description? Market data shows that women and people of color are less likely to apply to jobs unless they meet every single qualification. We are dedicated to building a diverse, inclusive, and authentic workplace that is free from discrimination and harassment; this allows us to make better decisions and better serve the communities we’re a part of. So if you're excited about this role but your previous experience doesn't align perfectly with every qualification in the job description, we encourage you to apply anyway. You may be just the right candidate for this or other roles.\n\nAll applicants receive consideration for employment. We do not discriminate on the basis of race, religion, color, national origin, gender identity, sexual orientation, pregnancy, age, marital status, veteran status, or disability status.\n\nCalifornia Residents: CCPA notice"
        },
        {
            "posted_at": null,
            "applications": null,
            "title": "Software Developer - SQL and JavaScript Specialist",
            "company_name": "Canoe Intelligence",
            "company_rating": null,
            "company_reviews": null,
            "location": "New York, NY 10013",
            "location_type": "Remote",
            "apply_link": "https://www.indeed.com/applystart?jk=341f1adda26db2c8&from=vj&pos=bottom&mvj=0&jobsearchTk=1hoqer59lj318814&spon=0&xkcb=SoB567M3DaVjd_wdwB0DbzkdCdPP&xfps=0220d87a-4925-4f86-a4c6-1c5526bed9b8&sjdu=YmZE5d5THV8u75cuc0H6Y26AwfY51UOGmh3Z9h4OvXhQpVlUW-jLUHWUDZtSzl2glxaZuDfho9stXdsKwQTzF2szpBA0R3UDK388sFU4glyujt4vx0kdhY2t08nbMvVx_XqK3EzK1AUPN3Pr8dCn--XYY2ku0XuQw_naUxrBQ3pOb4_dzT4dO2ShqnPG_WKBCITeI_Azw3KcSOf4X9Vh1Q&vjfrom=vjs&astse=4db3087b7273adcb&assa=8690",
            "pay": null,
            "job_type": null,
            "benefits": [
                "401(k)",
                "Commuter assistance",
                "Dental insurance",
                "Employee assistance program",
                "Gym membership",
                "Health insurance",
                "Paid time off"
            ],
            "description": "COMPANY: Canoe Intelligence\nWEBSITE: https://canoeintelligence.com/\nTITLE: Software Developer - SQL and JavaScript Specialist\nLOCATION: New York City (hybrid) or Fully Remote in the United States\nSALARY: $120,000 - $150,000 (based on NYC, will be adjusted for geo)\n\nThe Role:\nWe are seeking a talented Software Developer with expertise in SQL and JavaScript, along with a keen interest in developing internal tools using low-code solutions like ReTool.\nAs a Software Developer at Canoe, you will play a crucial role in designing, developing, and maintaining internal tools that empower our teams to work more efficiently. The ideal candidate will have a strong background in SQL and JavaScript, with a passion for creating scalable and user-friendly solutions. You will collaborate closely with cross-functional teams to understand their needs and translate them into effective low-code applications.\n\nWhat You’ll Do:\n\nDesign, develop, and maintain internal tools using SQL and JavaScript, ensuring high performance, responsiveness, and scalability.\nUtilize low-code platforms, particularly ReTool, to create intuitive and efficient tools for various departments within the organization.\nImplement and optimize database solutions, ensuring data integrity and security. Proficiency in SQL is essential for effective database management.\nWork closely with cross-functional teams to gather requirements, understand workflows, and deliver tailored solutions that enhance operational efficiency.\nStay abreast of industry trends and emerging technologies, actively contributing ideas for process improvement and tool enhancement.\n\nWhat We’re Looking For:\nRequired\n\nBachelor's degree in Computer Science, Software Engineering, or related field.\nProven experience in software development with a strong focus on SQL and JavaScript.\nFamiliarity with low-code development platforms, particularly ReTool, is highly desirable.\nSolid understanding of data management, storage and optimization.\nStrong problem-solving skills and attention to detail.\nExcellent communication and collaboration skills.\nPreferred\n\nExperience with front-end frameworks (e.g., React, Angular, Vue.js).\nKnowledge of RESTful API design and integration.\nFamiliarity with version control systems (e.g., Github).\nAbility to work independently and collaboratively in a fast-paced environment.\n\nWhat You’ll Get:\nMedical, dental, vision benefits\nFlexible PTO\n401(k)\nFlexible work from home policy\nHome office stipend + wifi reimbursement\nEmployee Assistance Program\nGym reimbursement\nEducation assistance\nParental Leave\nCommuter benefits\nOur Values:\nClient First —> Listen, and deliver client-centric solutions\nBe An Owner —> Take initiative, improve situations, drive positive outcomes\nExcellence —> Always set the highest standard for yourself and others\nWin Together —> 1 + 1 = 3\nWho We Are:\nCanoe is reimagining alternative investment data processes for hundreds of leading institutional investors, capital allocators, asset servicing firms and wealth managers. By combining industry expertise with the most sophisticated data capture technologies, Canoe’s technology automates the highly-frustrating, time-consuming, and costly manual workflows related to alternative investment document and data management, extraction and delivery. With Canoe, clients can refocus capital and human resources on business performance and growth, increase efficiency, and gain deeper access to their data. Canoe’s AI-driven platform was developed in 2013 for Portage Partners LLC, a private investment firm.\nCanoe is an equal opportunity employer. All aspects of employment including the decision to hire, promote, discipline, or discharge, will be based on merit, competence, performance, and business needs. We do not discriminate on the basis of race, color, religion, marital status, age, national origin, ancestry, physical or mental disability, medical condition, pregnancy, genetic information, gender, sexual orientation, gender identity or expression, veteran status, or any other status protected under federal, state, or local law."
        },
        {
            "posted_at": null,
            "applications": null,
            "title": "Senior Software Engineer",
            "company_name": "Warner Bros Careers",
            "company_rating": null,
            "company_reviews": null,
            "location": "New York, NY",
            "location_type": "Remote",
            "apply_link": "https://www.indeed.com/applystart?jk=64fb7feae17ad90b&from=vj&pos=bottom&mvj=0&jobsearchTk=1hoqer59lj318814&spon=0&xkcb=SoDN67M3DaVjd_wdwB0CbzkdCdPP&xfps=59e81943-f14f-47aa-b2ff-3cb9fb38fe96&sjdu=YmZE5d5THV8u75cuc0H6Y26AwfY51UOGmh3Z9h4OvXgOpcQY4PV8KkIWvEsFaQ1yf3jo2Grt-UT-EW1AISyAl8OFQrZqJnAMZEFbS94tFoTIohu8OynlYfJ9_fvmo38rIeLRMuesyObmJckz54y33Hrp8TsNcN1Y0RKLkG1pBt1Z6srzUJIuPSuiwoz8W_E8CITeI_Azw3KcSOf4X9Vh1Q&vjfrom=vjs&astse=2f3f26820d005ee3&assa=2026",
            "pay": null,
            "job_type": null,
            "benefits": [
                "Disability insurance",
                "Health insurance",
                "Retirement plan",
                "Wellness program"
            ],
            "description": "Every great story has a new beginning, and yours starts here.\nWelcome to Warner Bros. Discovery… the stuff dreams are made of.\nWho We Are…\nWhen we say, “the stuff dreams are made of,” we’re not just referring to the world of wizards, dragons and superheroes, or even to the wonders of Planet Earth. Behind WBD’s vast portfolio of iconic content and beloved brands, are the storytellers bringing our characters to life, the creators bringing them to your living rooms and the dreamers creating what’s next…\nFrom brilliant creatives, to technology trailblazers, across the globe, WBD offers career defining opportunities, thoughtfully curated benefits, and the tools to explore and grow into your best selves. Here you are supported, here you are celebrated, here you can thrive.\nWe are the now and the next. The power behind the people building the future. We are born from the spirit of innovation. We are created from the idea that people around the world want more, need more, deserve more. We are the home of the global digital revolution. We are CNN.\nTo see what it’s like to work at CNN, follow @WBDLife on Instagram and X!\nCNN Senior Software Engineer\nWe are CNN. The World’s most essential and engaging source of digital news. We are in the midst of rapid transformation and need you to help us find the next generation of innovators, makers, and dreams who will lead and drive our growth. We aim to make the world a better, more connected place. Join us!\nIt’s not about the level. It’s about you. We don’t want to put you in a box. We want you to break it. You will work in an environment of focused teams who are highly collaborative. Sharing experiences and skills across these teams strengthens us and our products.\nResponsibilities\nA successful candidate will have the following responsibilities:\nHands-on analysis, development and troubleshoot of highly distributed large-scale production products & systems.\nIntegration with internal publishing systems, code utilities and services\nWork in an agile development framework while collaborating with other developers to implement new software programs\nMaintain and improve the performance of existing software\nWrite high-quality, efficient, testable code\nCode in accordance with industry best practices and participate in the code review process, and documentation\nContribute to planning, design, implementation, testing, operations, and process improvement as a member of a Scrum team\nHold yourself and your team to high standards while maintaining friendly, respectful relationships\nBuild out applications and infrastructure for CNN suite of products\nContribute to the continuous improvement of the internal processes\nUnderstand and adhere to the Agile software development process\nWe Value\nStrong communication skills, ability to write technical docs and present ideas\nAbility to analyze, incorporate and apply new information and concepts\nEffective multi-tasking and tracking deliverables and timelines\nHighly self-directed and experienced in working as a fully remote engineer.\nAbility to write unit test cases, secure and maintainable code\nAgile software development using industry leading toolset like JIRA, GitHub, Confluence, etc.\nYou Must Have\nBS or MS in Computer Science or a related degree\n5+ years of development experience\nExperience building and maintaining applications on Cloud hosted infrastructure (experience on AWS preferred)\nMinimum of 3+ years of experience using CI/CD tools (git, GitHub, Jenkins, Terraform, CloudFormation)\nKnowledge of relational databases, SQL, and NoSQL\nFamiliar with AWS and Cloud technologies (S3, API Gateway, Lambdas)\nExperience in Java, Python\nKnowledge/Experience in Apache Flink a strong plus\nHow We Get Things Done…\nThis last bit is probably the most important! Here at WBD, our guiding principles are the core values by which we operate and are central to how we get things done. You can find them at www.wbd.com/guiding-principles/ along with some insights from the team on what they mean and how they show up in their day to day. We hope they resonate with you and look forward to discussing them during your interview.\nThe Legal Bits…\nIn compliance with local law, we are disclosing the compensation, or a range thereof, for roles in locations where legally required. Actual salaries will vary based on several factors, including but not limited to external market data, internal equity, location, skill set, experience, and/or performance. Base pay is just one component of Warner Bros. Discovery’s total compensation package for employees. Pay Range: $119,700.00 - $222,300.00 salary per year. Other rewards may include annual bonuses, short- and long-term incentives, and program-specific awards. In addition, Warner Bros. Discovery provides a variety of benefits to employees, including health insurance coverage, an employee wellness program, life and disability insurance, a retirement savings plan, paid holidays and sick time and vacation.\nWarner Bros. Discovery embraces the opportunity to build a workforce that reflects the diversity of our society and the world around us. Being an equal opportunity employer means that we take seriously our responsibility to consider qualified candidates on the basis of merit, without regard to race, color, religion, national origin, gender, sexual orientation, gender identity or expression, age, mental or physical disability, and genetic information, marital status, citizenship status, military status, protected veteran status or any other category protected by law.\nIf you’re a qualified candidate and you require adjustments or accommodations to search for a job opening or apply for a position, please contact us at recruitadmin@wbd.com."
        },
        {
            "posted_at": null,
            "applications": null,
            "title": "Staff Software Engineer, React for mmhmm",
            "company_name": "All Turtles",
            "company_rating": null,
            "company_reviews": null,
            "location": "New York, NY",
            "location_type": "Remote",
            "apply_link": "https://www.indeed.com/applystart?jk=45d51898dc1a7a46&from=vj&pos=bottom&mvj=0&jobsearchTk=1hoqer59lj318814&spon=0&xkcb=SoBQ67M3DaVjd_wdwB0BbzkdCdPP&xfps=40e11d44-3a86-4154-8bc1-673bea72951a&sjdu=YmZE5d5THV8u75cuc0H6Y26AwfY51UOGmh3Z9h4OvXhrx6j5OFCj6UXnpUICtrXorl65rVysw4cNNsVZunu7IS2216MpwTArIjLrdGxaB8MKMQvtfyBrpi8mThYv01QV4UiVTCYfgWZp8We4AfoFA9D73-wbJ17V62sWG-h2Tr8FX1DL2Br7mifocUlMLivGCITeI_Azw3KcSOf4X9Vh1Q&vjfrom=vjs&astse=a21bb30ce483f5b0&assa=7045",
            "pay": null,
            "job_type": null,
            "benefits": [
                "401(k)",
                "Dental insurance",
                "Health insurance",
                "Life insurance",
                "Vision insurance"
            ],
            "description": "mmhmm is an all-in-one platform for making, watching, and talking on videos. We're on a mission to make video an everyday tool that's accessible to everyone to communicate in the modern workplace.\nWe believe that making a video should feel as effortless as sending a text message, as quick as a chat, and as human as a coffee break.\nFounded in May 2020, mmhmm is a fully distributed, global company that builds products and services to make the Out-of-Office (OOO) work lifestyle possible.\nmmhmm is an All Turtles company. All Turtles is a globally distributed product studio that solves meaningful problems.\nAs a Staff Software Engineer, React at mmhmm, you'll work as part of a small cross-functional team of designers and engineers to create and improve end-user experiences in the browser. While your day-to-day responsibilities will focus on developing single page applications for the services that connect everything in the ecosystem, you'll also ensure coding standards are met and mentor team members. You'll work closely with backend engineers, designers, product managers and engineering managers to define the next release and guide the team to achieve it.\nYou're the right person for this job if you love to work on small, autonomous teams, take pride in the quality of both the code and user experiences that you create, and are passionate about developing for the browser.\nYOU'LL BE RESPONSIBLE FOR:\nSetting the technical direction and ensuring a high bar for code and architectural quality.\nBuilding both quick prototypes and robust production systems.\nMentoring others to encourage technical excellence when the opportunity presents itself.\nWorking closely with backend engineers to architect complex end-to-end user experiences. Strong understanding of backend concepts like databases and REST API design.\nWorking with members of the design team to implement user experiences that are elegant and simple, and embrace human interface guidelines.\nIdentifying components of the application that could be refactored for improved performance, clarity, or maintainability.\nDesigning software for scalability, maintainability, and security.\nEnsuring that we deliver at high quality, release after release.\nIDEALLY, YOU'LL HAVE:\nA track record of leading activities of a small team and dividing work by skill set.\n8+ years building complex web-based products from scratch. You're an expert at leading and building applications in HTML, CSS, JavaScript, and Typescript using React.\nExperience with Next.js preferred.\nStrong understanding of performance in the modern JavaScript ecosystem. You understand how to diagnose and improve performance issues, and you bring a strong baseline to the table when building new things.\nWorked closely with designers to create new experiences. You speak their language and share their values.\nWorked on projects that are user-centric. You're passionate about making products that real people will find indispensable.\nExceptional written and verbal communication skills, with an aptitude for conveying clear thoughts and ideas.\nWorked in a startup environment. You work autonomously and are comfortable with ambiguity and change.\nOur Principles\nAs a company, we realize that talent is evenly distributed throughout the world, but opportunity is not. We believe that you should work where you can have the best impact, and live where you can have the best life.\nCompensation\nThe salary range for this position is $185,000-$218,000 for a full-time Staff Engineer or Senior Staff Engineer based in the United States, but it may vary depending on your specific skills and experience. We've invested the time and effort to develop salary levels for all of our roles, for both individual contributors and managers. These levels are based on national compensation data, and are weighted to be competitive in the most expensive markets in the US. Final leveling and cash compensation will be determined at the end of the interview process.\nBenefits\nIn addition to base salary, our team receives equity and a variety of other benefits. We offer all US employees and their dependents comprehensive medical, dental, and vision insurance, covering 90% of the premium for employees, and 70% of the premium for qualifying dependents. US-based employees may also participate in our 401k, and we also offer life insurance.\nEveryone on the team is eligible for a bonus for meeting colleagues in person (an opportunity to build precious relationship capital with teammates), and our monthly distributed facilities supplement. The latter is money we add to everyone's payroll for you to set up a productive and distraction-free work environment, no strings attached, and no receipts required.\nHow We Work\nWe've recently decided to work seasonally–focused periods of work with limited breaks, followed by 2 consecutive weeks off all together, all at the same time. This means we work hard from early January to mid July, take a break, and focus on output from mid July through late December, and then take another break. It means other things too, but we'll explain it when we get into the interview process.\nThis Staff Software Engineer, React role is a full-time position reporting to the Senior Engineering Manager on the Frontend Web team. This role can be based in any location globally. Since our distributed team works across US time zones, US-based applicants are preferred.\nmmhmm is committed to creating and fostering a diverse team. We encourage people from underrepresented backgrounds and all walks of life to apply. We're committed to providing reasonable accommodations to all applicants throughout the application process."
        },
        {
            "posted_at": null,
            "applications": null,
            "title": "Senior Software Developer",
            "company_name": "TherapyNotes.com",
            "company_rating": null,
            "company_reviews": null,
            "location": "Philadelphia, PA",
            "location_type": "Remote",
            "apply_link": null,
            "pay": null,
            "job_type": null,
            "benefits": [
                "Dental insurance",
                "Flexible schedule",
                "Health insurance",
                "Profit sharing",
                "Retirement plan"
            ],
            "description": "About TherapyNotes\nTherapyNotes is a national leader in behavioral health Practice Management and Electronic Health Records (EHR) software. Our software-as-a-service (SaaS) solution is at the forefront of innovation, seamlessly integrating patient scheduling, medical records, billing, and electronic claims to revolutionize how mental health professionals manage their practices.\nAt TherapyNotes, we are a growing team of passionate and talented individuals. Our team thrives on collaboration and innovation, continually pushing the boundaries of what EHR software can do. We pride ourselves on our ability to adapt to the ever-evolving landscape of healthcare and technology, staying at the forefront of industry trends.\nWe believe in pushing each other to learn and solve complex problems, fostering an environment where your skills and expertise will flourish. Together, we are shaping the future of behavioral health software, making it easier for clinicians to provide the best possible care to their patients.\nIf you are passionate about technology, mental health, and making a difference, TherapyNotes is the place where you can realize your potential.\nDescription\nTherapyNotes is seeking a Senior Software Developer to join our growing team. We are looking for a passionate, experienced engineer who wants to work in a highly collaborative, team environment. The right candidate will have significant experience building highly scalable, responsive web applications and web services using technologies such as C#, Web API, TypeScript, and JavaScript. They will have demonstrated expertise with modern web technologies such as web sockets and service workers and have experience using these technologies to build single page applications (SPAs) and progressive web apps (PWAs). They will also possess both the desire and the capability to help build that expertise in others.\nResponsibilities\nFull-stack development including front end, business logic, and data access layers.\nTechnology stack consists of C#, JavaScript, TypeScript, CSS, HTML, ASP.NET, AJAX, PL/SQL, and WCF\nResponsible for full development life cycle from planning through successful release and support\nParticipate in decision making concerning software architecture and design\nParticipate in code reviews\nMentor and assist in the training and onboarding of other team members\nWork closely with other members of the development team and stakeholders\nMaintain high standards, attention to detail, accuracy and completeness\nRequirements\n7 or more years experience developing software in an Agile, team-based environment\n3 or more years experience developing responsive web applications\nBS and/or MS in a technical discipline (Computer Science or Software Engineering preferred)\nStrong understanding of OOP concepts and design patterns\nExpertise with C#, JavaScript, TypeScript, Bootstrap, CSS, and HTML\nExperience building single page applications (SPA) and progressive web apps (PWA)\nStrong understanding of web and browser technologies such as web sockets, service workers, LocalStorage, SessionStorage, and W3C manifests\nExperience with frameworks such as Node.js and React\nExperience with CSS preprocessors such as SASS or LESS is a plus\nExperience building RESTful web services using Web API\nExperience working with PostgreSQL, or other relational databases\nExcellent problem solving and communication skills\nCompetencies\nInnovation - Displays original thinking and creativity, meets challenges with resourcefulness. generates suggestions for improving work, develops innovative approaches and ideas, and presents ideas and information in a manner that gets others' attention.\nProblem Solving - Identifies and resolves problems in a timely manner, gathers and analyzes information skillfully, develops alternative solutions, and works well in group problem solving situations.\nAdaptability - Adapts to changes in the work environment, manages competing demands, changes approach or method to best fit the situation, and able to deal with frequent change, delays, or unexpected events.\nTeamwork - Balances team and individual responsibilities, exhibits objectivity and openness to others' views, gives and welcomes feedback, contributes to building a positive team spirit, puts success of team above own interests, able to build morale and group commitments to goals and objectives, and supports everyone's efforts to succeed.\nBenefits\nCompetitive salary - $110,000-$135,000/year\nComp-time and flexible work hours\nFull health, life, disability, and dental insurance\nRetirement plan with company contribution\nAnnual company profit sharing\nPersonal development/training budget\nOpen, collaborative work environment\nExtensive 2-week onboarding plan\nComprehensive mentorship program\nCompany provided refreshments\n#LI-Remote\n#LI-PL1\nTherapyNotes, LLC is an Equal Employment Opportunity Employer. All applicants will be considered for employment without attention to race, color, religion, sex, sexual orientation, gender identity, national origin, veteran or disability status. All candidates whom have been given a conditional offer of employment with TherapyNotes, LLC must also undergo a criminal background check.\n2/29/2024"
        },
        {
            "posted_at": null,
            "applications": null,
            "title": "Senior Front End Engineer",
            "company_name": "ChartHop",
            "company_rating": null,
            "company_reviews": null,
            "location": "New York, NY",
            "location_type": "Remote",
            "apply_link": null,
            "pay": null,
            "job_type": null,
            "benefits": [
                "401(k) matching",
                "Dental insurance",
                "Disability insurance",
                "Health insurance",
                "Life insurance",
                "Parental leave",
                "Pet insurance"
            ],
            "description": "ChartHop is on a mission to create healthy transparency within organizations, so that employees and organizations thrive. We are looking for a Senior Front End Engineer!\nSenior Front End Engineer\nSalary range - $140- $200K base plus bonus and equity\nJOB MISSION\n\nWe are looking for a front end engineer to help build world-class people software that delights our customers.\nYou’ll be joining a small but mighty team to help drive the mission and technical direction of ChartHop. Our tech stack leverages TypeScript and React on the front end, Kotlin and MongoDB on the back end, and AWS for infrastructure.\nAs a Senior Front End Engineer, you will:\nDevelop, maintain, and incrementally improve our web application\nParticipate in the full development lifecycle, from ideation and planning to deployment and post-launch maintenance\nImplement and maintain front-end tests, conduct code reviews, and follow best practices for code quality and maintainability\nCommunicate effectively with both technical and non-technical stakeholders, providing clear updates on progress, issues encountered, and solutions\n\nROLE KPIs\nWe will measure your success through:\nCode Quality: Measured through code reviews, adherence to best practices, and maintainability\nFeature Delivery: Proportion of features delivered on time and within scope\nContribution to Team Goals: Impact on overall team productivity, collaboration, and innovation\nContinuous Learning: Engagement in learning new technologies and sharing knowledge with the team\n\nSkills and Experiences We Value:\nProficiency in front-end software development with a focus on TypeScript and React\nGeneral understanding of back-end software development and a willingness to learn more\nUnderstanding of key web design considerations such as usability and accessibility\nAbility to leverage customer input to create functional, user-friendly web interfaces\nThoughtful and detail-oriented\nExcellent verbal and written communication skills\nAdvanced problem-solving skills\nObservant and able to remain focused on tasks for long periods of time\nWondering if you meet the qualifications? We seek to continue to grow an inclusive and representative team that will enhance our perspectives, skill sets, background and behaviors. We encourage engineering professionals who are passionate about this work to apply!\nWho we are:\nChartHop is on a mission to create healthy transparency within organizations, so that employees and organizations thrive. A dynamic People Operations Platform, ChartHop connects and visualizes people data to empower organizations through insights, alignment, and action. Bringing a fresh approach to HR, ChartHop’s People Operations Platform is the unified source for people data and the main point of action for day-to-day programs, processes, and initiatives. From People and Finance executives to managers and employees, ChartHop is designed for everyone in the organization.\nChartHop plays well with dozens of platforms through robust integrations across the HR tech stack, and serves companies like 1Password, YipitData, BetterCloud, and Starburst. Founded in 2019 by Ian White, ChartHop is backed by Andreessen Horowitz and Cox Enterprises. Visit ChartHop.com to learn more and follow ChartHop on Twitter and LinkedIn.\n\nOur Core Values:\nChartHop commits to being fair, inclusive, anti-racist, and equitable. We're building ChartHop to be the best People Software on the planet and that starts with hiring the best people globally. We’re building an inclusive culture we’re looking for people who embrace our core values:\n\nFast: Move with intentional speed.\nInclusive: Welcome our differences.\nTransparent: Trust, collaborate, share.\nOptimistic: Dream big, think practically.\nPerks and Benefits:\nInclusive Benefits and Perks for all humans (Medical, Dental, Vision, Life Insurance, LTD, STD)\nMental Health Benefits (Spring Health, Headspace, Calm)\nWork from home supplies stipend\nProfessional development stipend\nUnlimited Vacation\n13 Public Holidays\nFlex Fridays\n401K Match (US Employees)\nParental leave\nPet insurance\n\nPlease note, our salary ranges are based on current market data. Should you feel strongly that we are not in line, we highly recommend you to reach out and let us know. We are always looking to improve on building the best place for employees!\nChartHop is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to sex, gender identity, sexual orientation, race, color, religion, national origin, disability, protected Veteran status, age, or any other characteristic protected by applicable law.\nCompensation Range: $140K - $200K"
        },
        {
            "posted_at": null,
            "applications": null,
            "title": "Software Engineer, Collaboration",
            "company_name": "Tecton",
            "company_rating": null,
            "company_reviews": null,
            "location": "New York, NY",
            "location_type": "Remote",
            "apply_link": "https://www.indeed.com/applystart?jk=77a82b729fa9d433&from=vj&pos=bottom&mvj=0&jobsearchTk=1hoqer59lj318814&spon=0&xkcb=SoDe67M3DaVjd_wdwB0GbzkdCdPP&xfps=0ee264a4-d8d6-4c86-a52c-1834ee83da84&sjdu=YmZE5d5THV8u75cuc0H6Y26AwfY51UOGmh3Z9h4OvXi4Z4C-ghSa0ZN5IWkBpnM6V1ZNRIRjrkb0J4bvSELzoKdGKHikP06-IMH-Ze2WrcaC--2oQ-dKotsR1Idw1zJMtaik0Nrw4XPVHEqbOGvesQb6qsonLSmruqJm36Wz_3TvlXSj92_HA4-YrEcM3bbhCITeI_Azw3KcSOf4X9Vh1Q&vjfrom=vjs&astse=b839ecfcc8a25bdb&assa=1839",
            "pay": null,
            "job_type": null,
            "benefits": [
                "401(k)",
                "Dental insurance",
                "Health insurance",
                "Paid time off",
                "Vision insurance"
            ],
            "description": "At Tecton, we are on a mission to bring Machine Learning to every customer and product interaction on the planet. We build an enterprise-grade, world-class Feature Platform – the infrastructure that powers real-time ML applications and systems in production.\n\nTecton’s founders developed the first Feature Store when they created Uber’s Michelangelo ML platform, and we’re now bringing those same capabilities to every organization in the world.\n\nTecton is funded by Sequoia Capital, Andreessen Horowitz, and Kleiner Perkins, along with strategic investments from Snowflake and Databricks. We have a fast-growing team that’s distributed around the world, with offices in San Francisco and New York City. Our team has years of experience building and operating business-critical machine learning systems at leading tech companies like Uber, Google, Meta, Airbnb, Lyft, and Twitter.\n\nThe Collaboration team is about focusing on the needs of larger enterprise customers and enabling them to leverage the full potential of a Feature Platform. We make it easy for enterprise customers to manage, administer, and collaborate in the Tecton environment while meeting their security, compliance, and budgetary needs.\nResponsibilities\nPrimary ownership of building Tecton’s identity management, access control, and data governance that protect the most sensitive data of our customers\nBuilding out new capabilities for organizing, governing, and sharing features, audit logging, consumption measurement, and usage analytics\nPartnering with other teams to integrate the above with other Tecton capabilities\nQualifications\nAn engineer with 3+ years of backend experience (ex., Kotlin, Java, Python, Go, etc.) in Software Engineering\nPassion for building delightful products and end-user UX\nExcellent communication skills\nPreferred: Data infrastructure (Kubernetes, Terraform, etc.) and cloud (AWS, GCP, Azure) experience\nPreferred: Internal analytics experience\nPreferred: Auth and Access control systems experience\nPreferred: B2B SaaS and enterprise features experience\nPreferred: Full stack experience\nThe estimated US base salary range for this position is $189,000 - $258,000 annually for employees based within California & New York. In addition to base salary, we offer competitive equity & comprehensive benefits such as medical, dental, vision, life, 401(K), flexible paid time off, 10 paid holidays each calendar year, sick time, leave of absence as per the FMLA and other relevant leave laws. Individual compensation packages are based on multiple factors such as location, level, role scope, and complexity, as well as additional job-related factors such as skills, experience, and expertise.\nTecton values diversity and is an equal opportunity employer committed to creating an inclusive environment for all employees and applicants without regard to race, color, religion, national origin, gender, sexual orientation, age, marital status, veteran status, disability status, or other applicable legally protected characteristics. If you would like to request any accommodations from the application through to the interview, please contact us at recruitingteam@tecton.ai.\n\nThis employer participates in E-Verify and will provide the federal government with your Form I-9 information to confirm that you are authorized to work in the U.S."
        },
        {
            "posted_at": null,
            "applications": null,
            "title": "Software Engineer (Observability)",
            "company_name": "DigitalOcean",
            "company_rating": null,
            "company_reviews": null,
            "location": "New York, NY",
            "location_type": "Remote",
            "apply_link": null,
            "pay": null,
            "job_type": null,
            "benefits": [
                "Employee stock purchase plan",
                "Health insurance",
                "Parental leave",
                "Retirement plan",
                "Stock options"
            ],
            "description": "Do you ever wonder what happens inside the cloud?\nDigitalOcean (NYSE: DOCN) simplifies cloud computing so builders can spend more time creating software that changes the world. With our mission-critical infrastructure and fully managed offerings, DigitalOcean enables startups and small and medium-sized businesses (SMBs) to rapidly deploy and scale modern applications. As a remote-first organization, our employees, like our customers, are based around the world.\nWe want people who care about empowering their peers to understand their services.\nObservability Platforms is focused on creating visibility into DigitalOcean's services and infrastructure. We design, build, and operate the internal logging, metrics, distributed tracing, error reporting, monitoring, and alerting platforms that are depended on to ensure good, reliable experiences for DigitalOcean's customers. Through a mix of open source services and in-house developed software we seek to continuously improve the ability of DigitalOcean engineers and product managers to understand the behavior of their products and services in order to improve the experiences of our customers.\nWhat You'll Be Doing:\nIntegrating and operating open source observability software such as Elasticsearch, Prometheus, VictoriaMetrics, Alertmanager, Grafana, and Kibana.\nImplementing features to both improve the operability of our services and help design and implement the next generations of metrics and logging at DigitalOcean.\nGuiding other engineers on how they can best utilize our systems to gain confidence that their services are performing as expected.\nWhat We'll Expect From You:\nExperience with open source observability systems such as Elasticsearch and Prometheus, not just as an end user but as someone responsible for running and maintaining them.\nFamiliarity with running software on container orchestration systems such as Kubernetes or Nomad\nExperience writing software in Golang. Experience with the challenges of concurrency and distributed systems is a plus.\nExperience with DevOps tooling such as Terraform, Ansible, and Github Actions (or other relevant CI/CD experience).\nAn ability to work well as part of a geographically distributed team.\nParticipation in a 24/7 on call rotation\nSomeone who is motivated to learn, teach, grow, explore, and seek out areas we can improve\nStrong communication and customer service skills - we provide support to the internal users of the systems we design, build, and operate.\nWhy You'll Like Working for DigitalOcean:\nWe reward our employees. The base salary range for this position is between $100,000.00 - $150,000.00 based on relevant years of experience and skills. The salary range for this role is specific to candidates located within the U.S. and will vary for candidates outside the U.S.. The salary range for this position is based on relevant years of experience and skills. Employees may qualify for a bonus in addition to base salary; bonus amounts are determined based on company and individual performance. We also provide equity compensation to eligible employees including grants of equity upon hire and the option to participate in our Employee Stock Purchase Program.\nWe value development. You will work with some of the smartest and most interesting people in the industry. We are a high-performance organization that is always challenging our teams and employees to continuously grow. We maintain a growth mindset in everything we do and invest deeply in employee development through formalized mentorship and other internal programs. We provide all employees with reimbursement for relevant conferences, training, and education.\nWe care about your well-being. In addition to cash and equity compensation, we also offer employees a competitive array of benefits. In the United States, these include health insurance, unlimited vacation, retirement benefits, a generous parental leave program, and additional resources to support employees' overall well-being. While the philosophy around our benefits is the same worldwide, specific benefits may vary in other countries due to local regulations and preferences.\nWe value diversity and inclusivity. We are an equal opportunity employer and we do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.\nThis is a remote role\n#LI-Remote\nDepartment: Engineering #LI-Remote"
        },
        {
            "posted_at": null,
            "applications": null,
            "title": "Software Developer - AI Trainer (Contract)",
            "company_name": "DataAnnotation",
            "company_rating": null,
            "company_reviews": null,
            "location": "Oyster Bay, NY",
            "location_type": "Remote",
            "apply_link": "https://www.indeed.com/applystart?jk=0074ead0c10dfde2&from=vj&pos=bottom&mvj=0&jobsearchTk=1hoqer59lj318814&spon=1&adid=421854403&ad=-6NYlbfkN0CnM4TERr6XuVBW3VTRACvDXDx9S3Pbn6a0SwhkmoLTiNuchFC0m8cWtwLJyeogFE6nD9xZw0pjlqVK2qpwLhiAAEXdufMu5aH3wCQJflai5uTyhIxP7k0wWl-KQaFLz8Otq9jRjnnJw-9WjCOdUc4uLqm3cBbelJHHKV0ApNiNTVQZWZ5ZhbVUGHxtI1YgrI8XX4V5St2tXrEdFfzr4vdtgElZi9JqlyyAf4pt_3dbE99nJkmBPlX7N0Isg6m5sWmKOHa8DmfabngOJmk4XPX_VRvyUvTRSYD00guWwGU9dsVJIdD-24F9odOCeznjsfEwKigleFQrYZMBDbt-o4qbm5wQFcM6IM-7hPON8OrSxmSqCIN0gnqEQshZ7y1-CIcCYMjtXL_Z0N24SnWFM-0EkGnRRGfdhvyjXUyVD-HEIbt5hJdz78FI7OxuolSvLmbwZYspzf3yAHAPytCnsV_IcClCy6TedFveH4YasGmnYmntctRg3-aZw9XhJSYU_WiVzep319hTQglcYVpr_13AGwdHQSJ1MlDgpDRMSmAjpdN7z5jRBq4QPqC9JvPh3qPqrFaol3q9N5PKw43mLfTNN2lvjvz1xtWe-RhdrR2A3LKfViqPOv-y89Gowx5ZD4Jml8MO8mzgU6E5Obee4mJGzOvrr25hROYJv5wiXCGNr4iucamKVlVR5ATcy0gPxtgabqdcTcdhKxG-5uWimppSErw23723bbBfmuiLnR8GiqPeBAPcQLX8m6xmMIFBCswMguZ6OvD9pU-qHUASqDF7r6yTQckz-6U%3D&xkcb=SoAD6_M3DaVjd_wdwB0EbzkdCdPP&xfps=cbfb25da-15b0-4f30-9bfe-3c5c7c139c62&sjdu=vKhPcVALwvhco4xGfeDdzN04hQxfsLjKmen2GHhHHO9BLDnbVFpJPKuSCcl8rlO1Hgv27fz95hTrWUiwgb-_7kj7OTt2nswD-AcAWPXc-JCR1ac6_uQrNm8MJfQqQoraoRAVbOFJQtNR9Plbzb9m03vluJfoXaPSTGD0-a2MhFM_R6pt5_Q4cBNMQAuA6SKw&vjfrom=vjs&astse=1b44ecdf63877e10&assa=8264",
            "pay": null,
            "job_type": null,
            "benefits": [
                "Work from home"
            ],
            "description": "We are looking for proficient programmers to join our team to train our AI chatbots to code. You will work with the chatbots that we are building in order to measure their progress, as well as write and evaluate code.\nIn this role you will need to be proficient in at least one programming language and able to solve coding problems (think LeetCode, HackerRank, etc). For each coding problem, you must be able to explain how your solution solves the problem.\nBenefits:\nThis is a full-time or part-time REMOTE position\nYou’ll be able to choose which projects you want to work on\nYou can work on your own schedule\nProjects are paid hourly, with bonuses on high-quality and high-volume work\nResponsibilities:\nCome up with diverse problems and solutions for a coding chatbot\nWrite high-quality answers and code snippets\nEvaluate code quality produced by AI models for correctness and performance\nQualifications:\nFluency in English\nProficient in at least one programming language\nDetail-oriented\nExcellent writing and grammar skills\nA bachelor's degree (completed or in progress)\nNote: Payment is made via PayPal. We will never ask for any money from you. PayPal will handle any currency conversions from USD. This job is only available to those in the US, UK, Ireland, Canada, Australia, or New Zealand. Those located outside of these countries will not see work or assessments available on our site at this time.\nJob Type: Contract\nPay: From $40.00 per hour\nExpected hours: 1 – 40 per week\nBenefits:\nWork from home\nWork Location: Remote"
        }
    ]
}